BOT_TOKEN = "6316955575:AAECuppHspkO_rXyFbc8stscsVZdYHZcR-w"

search_all_button = "🔍 Փնտրել զրուցակից"
settings_button = "🔧 Կարգավորումներ"
female_button = "🙍🏼‍♀️ Աղջիկ զրուցակից"
male_button = "🙍🏼‍♂️ Տղա զրուցակից"
cancel_button = "🚫 Չեղարկել"

all_commands = ["🔍 Փնտրել զրուցակցին", "🔧 Կարգավորումներ", "🙍🏼‍♀️ Աղջիկ զրուցակից", "🙍🏼‍♂️ Տղա զրուցակից", "🚫 Չեղարկել", "/start", "/search"]
have_not_command = ["🔧 Կարգավորումներ", "🙍🏼‍♀️ Աղջիկ զրուցակից", "🙍🏼‍♂️ Տղա զրուցակից"]

select_gender_1_text = "1. Սկսելու համար ընտրեք ձեր սեռը:"
select_gender_2_text = "2. Այժմ ընտրեք ձեր տարիքային միջակայքը:"

select_male_button = "🙍🏼‍♂️ Տղա"
select_female_button = "🙍🏼‍♀️ Աղջիկ"

age_12_17 = "🔢 12-17"
age_18_29 = "🔢 18-29"
age_30_49 = "🔢 30-49"
age_50_90 = "🔢 50-90"

register_right = "Շնորհավորում ենք, այժմ կարող եք զրույց սկսել պատահական մարդու հետ:"

cannot_use_button = "💤 Դուք չեք կարող օգտագործել այս կոճակը:"

search_two_text = "💤 Դուք արդեն որոնման գործընթացում եք:"

have_companion_error = "💤 Դուք արդեն ունեք զրուցակից:"

queue_wait_text = "⏱ Դուք ավելացվել եք հերթի մեջ, խնդրում ենք սպասել:"

companion_right_text = """Գտնվել է զրուցակիցը 🦊\n\n/next - որոնել նոր զրուցակից\n/stop - ավարտել զրույցը\n/link - ուղարկել ձեր telegram-ը\n\n`https://t.me/AnonChatARM_bot`"""

queue_error_commands = "💤 Դուք չեք կարող օգտագործել այս հրամանը, քանի որ հերթի մեջեք:"
chats_error_commands = "💤 Դուք չեք կարող օգտագործել այս հրամանը, քանի որ շփվում եք զրուցակցի հետ:"
message_send_second_error = "💤 Դուք կարող եք ուղարկել միայն տեքստային հաղորդագրություն, նկար և տեսանյութ:"
message_send_error = "💤 Տեղի է ունեցել սխալ , խնդրում ենք ուղարկել միայն տեքստային հաղորդագրություն, նկար կամ տեսանյութ:"
message_send_blocked_error = "💤 Տեղի է ունեցել սխալ. Ձեր զրուցակիցն արգելափակել է բոտը։ Զրույցն ավարտված է։"
stop_search_text = "💤 Դուք դադարեցրել եք պատահական զրուցակից փնտրել։"
stop_conversation_text = "💤 Դուք դադարեցրեցիք խոսակցությունը:\n\nԳտնել մեկ այլ զրուցակից - /search"
stop_conversation_second_text = "💤 Ձեր զրուցակիցը դադարեցրեց խոսակցությունը:\n\nԳտնել մեկ այլ զրուցակից - /search"
error_commands = "💤 Դուք չեք կարող օգտագործել այս հրամանը:"
have_not_commands_text = "💤 Այս հրամանը դեռ հասանելի չէ:"
command_not_error = "💤 Այս հրամանը գոյություն չունի: Գրեք /start հրամանը:"